{"pageContext":{"html":"<p><a href=\"ctf=csaw-quals-2015\"></a>\n<a href=\"type=crypto\"></a>\n<a href=\"tags=cryptogram\"></a>\n<a href=\"tools=rumkin\"></a>\n<a href=\"techniques=\"></a></p>\n<h1>whiter0se (crypto-50)</h1>\n<p>We are given the cipher text:</p>\n<p>EOY XF, AY VMU M UKFNY TOY YF UFWHYKAXZ EAZZHN. UFWHYKAXZ ZNMXPHN. UFWHYKAXZ EHMOYACOI. VH'JH EHHX CFTOUHP FX VKMY'U AX CNFXY FC OU. EOY VH KMJHX'Y EHHX IFFQAXZ MY VKMY'U MEFJH OU.</p>\n<p>Could this be ceasar cipher? Let's check all 26 shifts:</p>\n<pre><code>yis rzz us pgo g oezhs nis sz ozqbseurt yuttbhb ozqbseurt thgrjbhb ozqbseurt ybgisuwicb pbudb ybbr wzniobj zr pegsuo ur whzrs zw iob yis pb egdbrus ybbr czzkurt gs pegsuo gyzdb iob\nzjt saa vt qhp h pfait ojt ta parctfvsu zvuucic parctfvsu uihskcic parctfvsu zchjtvxjdc qcvec zccs xaojpck as qfhtvp vs xiast ax jpc zjt qc fhecsvt zccs daalvsu ht qfhtvp hzaec jpc\naku tbb wu riq i qgbju pku ub qbsdugwtv awvvdjd qbsdugwtv vjitldjd qbsdugwtv adikuwyked rdwfd addt ybpkqdl bt rgiuwq wt yjbtu by kqd aku rd gifdtwu addt ebbmwtv iu rgiuwq iabfd kqd\nblv ucc xv sjr j rhckv qlv vc rctevhxuw bxwweke rctevhxuw wkjumeke rctevhxuw bejlvxzlfe sexge beeu zcqlrem cu shjvxr xu zkcuv cz lre blv se hjgeuxv beeu fccnxuw jv shjvxr jbcge lre\ncmw vdd yw tks k sidlw rmw wd sdufwiyvx cyxxflf sdufwiyvx xlkvnflf sdufwiyvx cfkmwyamgf tfyhf cffv adrmsfn dv tikwys yv aldvw da msf cmw tf ikhfvyw cffv gddoyvx kw tikwys kcdhf msf\ndnx wee zx ult l tjemx snx xe tevgxjzwy dzyygmg tevgxjzwy ymlwogmg tevgxjzwy dglnxzbnhg ugzig dggw besntgo ew ujlxzt zw bmewx eb ntg dnx ug jligwzx dggw heepzwy lx ujlxzt ldeig ntg\neoy xff ay vmu m ukfny toy yf ufwhykaxz eazzhnh ufwhykaxz znmxphnh ufwhykaxz ehmoyacoih vhajh ehhx cftouhp fx vkmyau ax cnfxy fc ouh eoy vh kmjhxay ehhx iffqaxz my vkmyau mefjh ouh\nfpz ygg bz wnv n vlgoz upz zg vgxizlbya fbaaioi vgxizlbya aonyqioi vgxizlbya finpzbdpji wibki fiiy dgupviq gy wlnzbv by dogyz gd pvi fpz wi lnkiybz fiiy jggrbya nz wlnzbv nfgki pvi\ngqa zhh ca xow o wmhpa vqa ah whyjamczb gcbbjpj whyjamczb bpozrjpj whyjamczb gjoqaceqkj xjclj gjjz ehvqwjr hz xmoacw cz ephza he qwj gqa xj moljzca gjjz khhsczb oa xmoacw oghlj qwj\nhrb aii db ypx p xniqb wrb bi xizkbndac hdcckqk xizkbndac cqpaskqk xizkbndac hkprbdfrlk ykdmk hkka fiwrxks ia ynpbdx da fqiab if rxk hrb yk npmkadb hkka liitdac pb ynpbdx phimk rxk\nisc bjj ec zqy q yojrc xsc cj yjalcoebd ieddlrl yjalcoebd drqbtlrl yjalcoebd ilqscegsml zlenl illb gjxsylt jb zoqcey eb grjbc jg syl isc zl oqnlbec illb mjjuebd qc zoqcey qijnl syl\njtd ckk fd arz r zpksd ytd dk zkbmdpfce jfeemsm zkbmdpfce esrcumsm zkbmdpfce jmrtdfhtnm amfom jmmc hkytzmu kc aprdfz fc hskcd kh tzm jtd am promcfd jmmc nkkvfce rd aprdfz rjkom tzm\nkue dll ge bsa s aqlte zue el alcneqgdf kgffntn alcneqgdf ftsdvntn alcneqgdf knsuegiuon bngpn knnd ilzuanv ld bqsega gd itlde li uan kue bn qspndge knnd ollwgdf se bqsega sklpn uan\nlvf emm hf ctb t brmuf avf fm bmdofrheg lhggouo bmdofrheg gutewouo bmdofrheg lotvfhjvpo cohqo looe jmavbow me crtfhb he jumef mj vbo lvf co rtqoehf looe pmmxheg tf crtfhb tlmqo vbo\nmwg fnn ig duc u csnvg bwg gn cnepgsifh mihhpvp cnepgsifh hvufxpvp cnepgsifh mpuwgikwqp dpirp mppf knbwcpx nf dsugic if kvnfg nk wcp mwg dp surpfig mppf qnnyifh ug dsugic umnrp wcp\nnxh goo jh evd v dtowh cxh ho dofqhtjgi njiiqwq dofqhtjgi iwvgyqwq dofqhtjgi nqvxhjlxrq eqjsq nqqg locxdqy og etvhjd jg lwogh ol xdq nxh eq tvsqgjh nqqg roozjgi vh etvhjd vnosq xdq\noyi hpp ki fwe w eupxi dyi ip epgriukhj okjjrxr epgriukhj jxwhzrxr epgriukhj orwyikmysr frktr orrh mpdyerz ph fuwike kh mxphi pm yer oyi fr uwtrhki orrh sppakhj wi fuwike woptr yer\npzj iqq lj gxf x fvqyj ezj jq fqhsjvlik plkksys fqhsjvlik kyxiasys fqhsjvlik psxzjlnzts gslus pssi nqezfsa qi gvxjlf li nyqij qn zfs pzj gs vxusilj pssi tqqblik xj gvxjlf xpqus zfs\nqak jrr mk hyg y gwrzk fak kr gritkwmjl qmlltzt gritkwmjl lzyjbtzt gritkwmjl qtyakmoaut htmvt qttj orfagtb rj hwykmg mj ozrjk ro agt qak ht wyvtjmk qttj urrcmjl yk hwykmg yqrvt agt\nrbl kss nl izh z hxsal gbl ls hsjulxnkm rnmmuau hsjulxnkm mazkcuau hsjulxnkm ruzblnpbvu iunwu ruuk psgbhuc sk ixzlnh nk paskl sp bhu rbl iu xzwuknl ruuk vssdnkm zl ixzlnh zrswu bhu\nscm ltt om jai a iytbm hcm mt itkvmyoln sonnvbv itkvmyoln nbaldvbv itkvmyoln svacmoqcwv jvoxv svvl qthcivd tl jyamoi ol qbtlm tq civ scm jv yaxvlom svvl wtteoln am jyamoi astxv civ\ntdn muu pn kbj b jzucn idn nu julwnzpmo tpoowcw julwnzpmo ocbmewcw julwnzpmo twbdnprdxw kwpyw twwm ruidjwe um kzbnpj pm rcumn ur djw tdn kw zbywmpn twwm xuufpmo bn kzbnpj btuyw djw\nueo nvv qo lck c kavdo jeo ov kvmxoaqnp uqppxdx kvmxoaqnp pdcnfxdx kvmxoaqnp uxceoqseyx lxqzx uxxn svjekxf vn lacoqk qn sdvno vs ekx ueo lx aczxnqo uxxn yvvgqnp co lacoqk cuvzx ekx\nvfp oww rp mdl d lbwep kfp pw lwnypbroq vrqqyey lwnypbroq qedogyey lwnypbroq vydfprtfzy myray vyyo twkflyg wo mbdprl ro tewop wt fly vfp my bdayorp vyyo zwwhroq dp mbdprl dvway fly\nwgq pxx sq nem e mcxfq lgq qx mxozqcspr wsrrzfz mxozqcspr rfephzfz mxozqcspr wzegqsugaz nzsbz wzzp uxlgmzh xp nceqsm sp ufxpq xu gmz wgq nz cebzpsq wzzp axxispr eq nceqsm ewxbz gmz\nxhr qyy tr ofn f ndygr mhr ry nypardtqs xtssaga nypardtqs sgfqiaga nypardtqs xafhrtvhba oatca xaaq vymhnai yq odfrtn tq vgyqr yv hna xhr oa dfcaqtr xaaq byyjtqs fr odfrtn fxyca hna\n</code></pre>\n<p>Nothing meaningful. Could be substitution cipher. We don't have any other clue, so we have to manually do a crypt analysis. Before doing that let's try out some online tools.</p>\n<p>Went to <a href=\"http://rumkin.com/tools/cipher/cryptogram-solver.php\">http://rumkin.com/tools/cipher/cryptogram-solver.php</a> and entered the given cipher,</p>\n<p>Aaand we get our flag:</p>\n<blockquote>\n<p>BUT NO, IT WAS A SHORT CUT TO SOMETHING BIGGER. SOMETHING GRANDER. SOMETHING BEAUTIFUL. WE'VE BEEN FOCUSED ON WHAT'S IN FRONT OF US. BUT WE HAVEN'T BEEN LOOKING AT WHAT'S ABOVE US.</p>\n</blockquote>","relativePath":"writeups/csaw-quals-2015/crypto/whiter0se/chaitan94"}}